node/persistence/db/performance/test/load/long-queries.yml
config:
   http:
      # Responses have to be sent within 10 seconds or the request will be aborted
      timeout: 10
   plugins:
      expect: {}
   phases:
      -  duration: 1
         arrivalRate: 1
   defaults:
      headers:
         x-correlation-id: 3

before:
   flow:
      -  function: "removeAll"

scenarios:
   -  name: 'execute a long query'
      flow:
         -  post:
               url: "/foo"
               json:
                  count: 1000
               expect:
                  -  statusCode: 200
         -  get:
               url: "/foo/long-query"
               expect:
                  -  statusCode: 200
   -  name: 'execute a very long query (should timeout)'
      flow:
         -  post:
               url: "/foo"
               json:
                  count: 100000
               expect:
                  -  statusCode: 200
         -  get:
               url: "/foo/long-query"
               expect:
                  -  statusCode: 200