node/persistence/db/performance/test/load/medium-queries.yml
config:
#   plugins:
#      expect: {}
   phases:
      -  duration: 2
         arrivalRate: 5
      -  duration: 10
         arrivalRate: 5
         rampTo: 50

scenarios:
   -  name: 'query on more data'
      flow:
         - function: "removeAll"
         -  post:
               url: "/foo"
               json:
                  count: 100
               expect:
                  -  statusCode: 200
         -  get:
               url: "/foo/short-query"
               expect:
                  -  statusCode: 200